[
    {
        "collapse": "one",
        "period": {
            "begin": "01/2010",
            "end": "Today"
        },
        "company": {
            "name": "Weev Brasil",
            "location": "Florianópolis - SC"
        },
        "position": "Solution Architect",
        "activities": [
            "Extensive JEE knowledge, including all APIs (EJB, JPA, JMS, etc), used on back-end development and architecture for a big financial system, which controls customer's banking accounts, managing loans, savings and all the normal banking operations.",
            "Work experience abroad. 4 1/2 months working on the aforementioned project in The Netherlands, making decisions on the architecture and getting to know the team better. All the communication between the Brazilian and Dutch teams was in English.",
            "Front-end developer for a mobile application using HTML5, CSS3, Phonegap and AngularJS."
        ]
    },
    {
        "collapse": "two",
        "period": {
            "begin": "06/2009",
            "end": "01-2010"
        },
        "company": {
            "name": "Neoway",
            "location": "Florianópolis - SC"
        },
        "position": "System Analyst",
        "activities": [
            "System integration using the Ensemble integration platform and the Caché database. Develop integration software to integrate a variety of systems belonging to the most different sectors of State Department of Administration (Secretaria Estadual de Adiministração), a department of the state of Santa Catarina.",
            "Develop a web application for ALESC (Santa Catarina State Assembly), which helped the assemblymen to control the execution and lifecycle of legal proceedings."
        ]
    },
    {
        "collapse": "three",
        "period": {
            "begin": "10/2007",
            "end": "06/2009"
        },
        "company": {
            "name": "Prosul, Projetos e Supervisão Ltda.",
            "location": "Florianópolis - SC"
        },
        "position": "System Analyst",
        "activities": [
            "Develop the Web Portal using Java and the J2EE technology - JSF and EJB 3.1, more specifically.",
            "Install, configure and maintain the JBoss AS.",
            "Administer and create new procedures for the company management system, Microsiga Advanced Protheus, using ADVPL and ADVPL-ASP as languages.",
            "Implement Web Service procedures to integrate the Web Portal with the Microsiga System, from the configuration to the creation of services in ADVPL and Java.",
            "Administer the whole DB2 Database."
        ]
    },
    {
        "collapse": "four",
        "period": {
            "begin": "04/2006",
            "end": "10/2007"
        },
        "company": {
            "name": "Prosul, Projetos e Supervisão Ltda.",
            "location": "Florianópolis - SC"
        },
        "position": "Programmer Trainee",
        "activities": [
            "Develop the Web Portal using Java and the J2EE technology - Servlets JSP, more specifically.",
            "Administer and create new procedures for the company management system, Microsiga Advanced Protheus, using ADVPL and ADVPL-ASP as languages.",
            "Implement Web Service procedures to integrate the Web Portal with the Microsiga System, from the configuration to the creation of ADVPL services in Java.",
            "Administer the whole DB2 Database."
        ]
    },
    {
        "collapse": "five",
        "period": {
            "begin": "11/2004",
            "end": "04/2006"
        },
        "company": {
            "name": "Laboratório de Transportes - ECV - UFSC",
            "location": "Florianópolis - SC"
        },
        "position": "Programmer",
        "activities": [
            "Develop Geographic Information Systems (GIS) with Delphi, by using dbExpress and the SQL Server, Postgres SQL and Oracle databases."
        ]
    },
    {
        "collapse": "six",
        "period": {
            "begin": "07/2000",
            "end": "02/2004"
        },
        "company": {
            "name": "Zanettini, Barossi S/A - Ind e Com.",
            "location": "São Paulo - SP"
        },
        "position": "Junior Systems Analyst",
        "activities": [
            "Manage the ERP System, which has been developed internally to cover all steps from the clients' request to the invoice, including the purchase and production planning, and the inventory and production control. Manage the database and provide all the necessary maintenance for the system update.",
            "Maintain the purchased systems: Microsiga (accounting) and RM-Labore (Human Resources and Personnel Department).",
            "Control the information exchange services via formatted files, such as: bank transactions, purchase requests, and Electronic Data Interchange (EDI)."
        ]
    },
    {
        "collapse": "seven",
        "period": {
            "begin": "03/2000",
            "end": "07/2000"
        },
        "company": {
            "name": "Zanettini, Barossi S/A - Ind e Com.",
            "location": "São Paulo - SP"
        },
        "position": "Trainee",
        "activities": [
            "Learn about the ERP System, developed internally, and the database (Unify 2000/SQL Language), and administer the UNIX network.",
            "Acquire practical knowledge of the ERP System; provide small maintenance services on the database; write reports."
        ]
    }
]
